app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (actors LIKE '%bruce%')  ORDER BY created_at DESC
---
  def search
    @movie_search = Movie.search(params[:search], params[:search_param])

INSERT INTO "movies" ("genre", "actors", "title", "year", "rating") VALUES (?, ?, ?, ?, ?)  [["genre", "Action"], ["actors", "Bruce Willis"], ["title", "Die Hard"], ["year", 1992], ["rating", 5]]
---
  def create
     @movie_create = Movie.create!(genre: params[:genre], actors: params[:actors], title: params[:title], year: params[:year], rating: params[:rating])

DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 2]]
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 2]]
---
  def destroy
    @movie_destroy = Movie.find(params[:id]).destroy

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "movies" SET "genre" = ?, "actors" = ?, "title" = ?, "year" = ?, "rating" = ? WHERE "movies"."id" = ?  [["genre", "Actionss"], ["actors", "Bruce Willisss"], ["title", "Die Hard 3"], ["year", 1993], ["rating", 4], ["id", 7]]
---
  def update
    @movie_update = Movie.find(params[:id])
    @movie_update.update_attributes(genre: params[:genre], actors: params[:actors], title: params[:title], year: params[:year], rating: params[:rating])